In [4]:
import pandas as pd

In [7]:
df = pd.DataFrame(
    [
        [1, 2, 3],
        [4, 5, 6],
        [7, 8 , 9]
    ]
)

In [8]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [12]:
df.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [13]:
df.loc[1, 1]

5

In [18]:
df.loc[1:3, 1:3]

   1  2
1  5  6
2  8  9